NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_application_peripherals.h
/*RRAM controller GLITCH detector*/
#define RRAMC_PRESENT 1
#define RRAMC_COUNT 1

#define RRAMC_NAPMODE 1                              /*!< (unspecified)                                                        */
#define RRAMC_NRRAMDATAUNITSIZE 128                  /*!< RRAM data unit size : 128 bits per data unit                         */
#define RRAMC_NWRITEBUFSIZE 32                       /*!< Maximum write buffer size : 32                                       */
#define RRAMC_LOWPOWERCONFIGOPTION2 0                /*!< (unspecified)                                                        */
#define RRAMC_REGION0ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0SIZE 4                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION0EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION0EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION0SECURE 0                        /*!< (unspecified)                                                        */
#define RRAMC_REGION0SECURE_WRITABLE 0               /*!< (unspecified)                                                        */
#define RRAMC_REGION0OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION0OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITEONCE 1                     /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITEONCE_WRITABLE 0            /*!< (unspecified)                                                        */
#define RRAMC_REGION0LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1SIZE 4                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION1EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION1EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION1SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION1SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION1OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION1OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITEONCE 1                     /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITEONCE_WRITABLE 0            /*!< (unspecified)                                                        */
#define RRAMC_REGION1LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2SIZE 8                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION2EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION2EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION2SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION2SECURE_WRITABLE 0               /*!< (unspecified)                                                        */
#define RRAMC_REGION2OWNER 2                         /*!< (unspecified)                                                        */
#define RRAMC_REGION2OWNER_WRITABLE 0                /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION2LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3SIZE 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3SIZE_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION3EXECUTE 1                       /*!< (unspecified)                                                        */
#define RRAMC_REGION3EXECUTE_WRITABLE 1              /*!< (unspecified)                                                        */
#define RRAMC_REGION3SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION3SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION3OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION3OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION3LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4ADDR_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4SIZE 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4SIZE_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION4EXECUTE 1                       /*!< (unspecified)                                                        */
#define RRAMC_REGION4EXECUTE_WRITABLE 1              /*!< (unspecified)                                                        */
#define RRAMC_REGION4SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION4SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION4OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION4OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION4LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_GLITCHDETECTORS 0                      /*!< (unspecified)                                                        */

